[
    {
      "name": "Keraton Surakarta",
      "location": [
        -7.57789006727657,
        110.82801639294668
      ],
      "description": "Keraton Surakarta Hadiningrat adalah istana resmi Kasunanan Surakarta. Keraton ini menjadi simbol kebudayaan Jawa dan menawarkan wisata sejarah serta budaya. Anda bisa mengikuti tur untuk menjelajahi kompleks istana yang luas dan melihat berbagai koleksi peninggalan sejarah."
    },
    {
      "name": "Pasar Klewer",
      "location": [
        -7.575423368414366, 
        110.82669115079365
      ],
      "description": "Pasar Klewer adalah pasar tekstil terbesar di Solo dan terkenal dengan batik. Pasar ini menawarkan berbagai jenis batik, mulai dari yang tradisional hingga yang modern. Berbelanja di Pasar Klewer memberikan pengalaman yang khas dan otentik."
    },
    {
      "name": "Taman Sriwedari",
      "location": [
        -7.568639539988875, 
        110.81312414099864
      ],
      "description": "Taman Sriwedari adalah taman hiburan yang memiliki sejarah panjang sebagai pusat seni dan budaya di Solo. Taman ini sering digunakan untuk pertunjukan wayang orang dan berbagai acara budaya lainnya."
    },
    {
      "name": "Museum Batik Danar Hadi",
      "location": [
        -7.568697874183584, 
        110.81616773360204
      ],
      "description": "Museum Batik Danar Hadi menampilkan koleksi batik yang kaya dan beragam dari berbagai daerah di Indonesia. Museum ini tidak hanya memamerkan batik tradisional, tetapi juga mengedukasi pengunjung tentang proses pembuatan batik."
    },
    {
      "name": "Pura Mangkunegaran",
      "location": [
        -7.56715371732532, 
        110.82266261187846
      ],
      "description": "Pura Mangkunegaran adalah istana kecil yang didirikan oleh Mangkunegara I. Pura ini menawarkan arsitektur Jawa yang indah dan memiliki koleksi seni dan budaya yang menarik. Anda bisa mengikuti tur untuk menjelajahi interior istana dan melihat berbagai koleksi berharga."
    },
    {
      "name": "Grojogan Sewu Tawangmangu",
      "location": [
        -7.661554758461716, 
        111.12848929127469
      ],
      "description": "Grojogan Sewu adalah air terjun terkenal di kawasan Tawangmangu, Solo. Air terjun ini memiliki ketinggian sekitar 80 meter dan dikelilingi oleh hutan yang lebat, memberikan suasana yang sejuk dan alami. Tempat ini cocok untuk berwisata alam dan menikmati keindahan alam."
    },
    {
      "name": "Bengawan Solo Park",
      "location": [
        -7.5650618697025385, 
        110.86129940846477
      ],
      "description": "Bengawan Solo Park adalah taman kota yang indah di tepi Sungai Bengawan Solo. Taman ini cocok untuk berjalan-jalan santai, bersepeda, atau sekadar menikmati pemandangan sungai. Tempat ini juga sering digunakan untuk berbagai acara komunitas dan festival."
    },
    {
      "name": "Pasar Gede",
      "location": [
        -7.569335329307067, 
        110.83187375270381
      ],
      "description": "Pasar Gede adalah pasar tradisional terbesar di Solo, menawarkan berbagai jenis makanan, produk segar, dan barang-barang rumah tangga. Pasar ini merupakan tempat yang tepat untuk merasakan kehidupan sehari-hari masyarakat Solo dan mencicipi makanan khas daerah."
    },
    {
      "name": "Kampung Batik Laweyan",
      "location": [
        -7.569988617363491, 
        110.80037451766265
      ],
      "description": "Kampung Batik Laweyan adalah kawasan di Solo yang terkenal dengan produksi batik. Di sini, Anda bisa melihat langsung proses pembuatan batik dan berbelanja berbagai jenis batik. Kampung ini juga memiliki bangunan-bangunan bersejarah dengan arsitektur yang unik."
    },
    {
      "name": "De Tjolomadoe",
      "location": [
        -7.534039549897034, 
        110.74974821002692
      ],
      "description": "De Tjolomadoe adalah bekas pabrik gula yang telah diubah menjadi tempat wisata dan pusat seni. Tempat ini menawarkan tur pabrik, museum gula, serta berbagai acara seni dan budaya. Arsitekturnya yang unik dan sejarahnya yang kaya menjadikan tempat ini menarik untuk dikunjungi."
    },
    {
        "name": "Museum Radya Pustaka",
        "location": [
            -7.568515440010421, 
            110.81451836798506
        ],
        "description": "Museum Radya Pustaka adalah museum tertua di Indonesia yang menyimpan berbagai koleksi benda bersejarah, termasuk manuskrip kuno, arca, dan berbagai peninggalan budaya Jawa. Museum ini memberikan wawasan mendalam tentang sejarah dan kebudayaan Solo."
      },
      {
        "name": "Pandawa Water World",
        "location": [
            -7.605363713399836, 
            110.80411331216362
        ],
        "description": "Pandawa Water World adalah taman rekreasi air yang menawarkan berbagai wahana seru dan menyenangkan untuk keluarga. Taman ini terinspirasi oleh kisah Mahabharata dan memiliki berbagai seluncuran air, kolam renang, dan area bermain air untuk anak-anak."
      },
      {
        "name": "Agrowisata Sondokoro",
        "location": [
            -7.576296692427717, 
            110.93150515079373
        ],
        "description": "Agrowisata Sondokoro adalah destinasi wisata edukatif yang menawarkan pengalaman unik untuk belajar tentang pertanian dan perkebunan. Anda bisa menikmati suasana pedesaan, berkeliling kebun, dan melihat proses pembuatan gula tradisional."
      },
      {
        "name": "Solo Paragon Mall",
        "location": [
            -7.562506854159498, 
            110.81022031586113
        ],
        "description": "Solo Paragon Mall adalah pusat perbelanjaan modern di Solo yang menawarkan berbagai toko, restoran, dan hiburan. Mall ini adalah tempat yang sempurna untuk berbelanja, bersantap, atau sekadar bersantai."
      },
      {
        "name": "Alun-Alun Kidul Surakarta",
        "location": [
            -7.582045701986426, 
            110.8266783870259
        ],
        "description": "Alun-Alun Kidul Surakarta adalah alun-alun yang sering digunakan untuk berbagai kegiatan sosial dan budaya. Tempat ini menjadi pusat keramaian, terutama pada malam hari, dengan berbagai aktivitas seperti bersepeda dan menikmati kuliner malam."
      },
      {
        "name": "Solo Safari",
        "location": [
            -7.564530002337529, 
            110.85838231825963
        ],
        "description": "Solo Safari adalah kebun binatang di Solo yang menampilkan berbagai jenis satwa. Kebun binatang ini merupakan tempat yang menyenangkan untuk dikunjungi bersama keluarga, terutama anak-anak."
      },
      {
        "name": "Museum Keris Nusantara",
        "location": [
            -7.569105623188264, 
            110.81062538119389
        ],
        "description": "Museum Keris Nusantara adalah museum yang didedikasikan untuk senjata tradisional Indonesia, terutama keris. Museum ini menampilkan koleksi keris yang beragam dan memberikan informasi tentang sejarah dan budaya keris."
      }
  ]
  